//  problem 3

// 3. আমরা for লুপ ব্যাবহার করে ১ থেকে ১০ এর যোগফল বের করেছি। নিচের ৫টি  ধারা গুলোর যোগফল বের করার জন্য প্রোগ্রাম লিখ।
// 1+2+3+.....50
// 1+3+5+...+29 ( প্রথম ২০টি পদ)
// 50 + 49 + 48 + 47 + …… ( প্রথম ১০টি পদ)
// 2 + 5 + 8 + 11 + 14 + …..   (প্রথম ১০টি পদ)
// 100 + 97 + 94 + 91 + ….  (0 এর চেয়ে বড় পর্যন্ত)

// A:1+2+3+.....50 ?????????

 var sum=1;

for(i=1; i<=50; i=i+1){
    sum=sum+i;
    console.log(sum);
   }
  

//  1+3+5+...+29 ( প্রথম ২০টি পদ) ?????????

sum=1;
for(i=1; i<=20; i=i+1){
    sum=sum+i;
    console.log(sum);
}

// 50 + 49 + 48 + 47 + …… ( প্রথম ১০টি পদ)????????
sum=50;
for(i=50; i<=47; i=i-1){
    sum=sum+i;
   
}
console.log(sum);




// 2 + 5 + 8 + 11 + 14 + …..   (প্রথম ১০টি পদ)???????
sum=2;
for(i=2; i<=14; i=i+1){
    sum=sum+i;
    console.log(sum);
}


// 100 + 97 + 94 + 91 + ….  (0 এর চেয়ে বড় পর্যন্ত)???????
